

# ==============================================
# READ RTL
# ==============================================

read_verilog "D:\AI_EDA_TOOL\backend\uploads\FULL_ADDER.v"

hierarchy -check -top FULL_ADDER

# ==============================================
# RTL PROCESSING
# ==============================================

proc
opt

# ==============================================
# FSM EXTRACTION
# ==============================================

fsm
opt

# ==============================================
# MEMORY HANDLING
# ==============================================

memory
opt

# ==============================================
# TECH MAPPING
# ==============================================

techmap
opt

clean

# ==============================================
# GENERATE RTL SCHEMATIC
# ==============================================

show \
    -format dot \
    -prefix "FULL_ADDER"

